Repository: inartov555/user_hub_web_app
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: cs_cz, es_es, et_ee, fi_fi

source: Unknown error.
cs_cz: Neznámá chyba.
es_es: Error desconocido.
et_ee: Tundmatu viga.
fi_fi: Tuntematon virhe.

source: Not authenticated.
cs_cz: Neautentizováno.
es_es: No autenticado.
et_ee: Pole autentitud.
fi_fi: Ei todennettu.

source: Authentication credentials were not provided.
cs_cz: Nebyly poskytnuty přihlašovací údaje.
es_es: No se proporcionaron credenciales de autenticación.
et_ee: Autentimisandmeid ei esitatud.
fi_fi: Tunnistautumistietoja ei annettu.

source: You do not have permission to perform this action.
cs_cz: Nemáte oprávnění k provedení této akce.
es_es: No tienes permiso para realizar esta acción.
et_ee: Sul pole selle toimingu õigust.
fi_fi: Sinulla ei ole oikeuksia suorittaa tätä toimintoa.

source: Not found.
cs_cz: Nenalezeno.
es_es: No encontrado.
et_ee: Ei leitud.
fi_fi: Ei löytynyt.

source: A server error occurred.
cs_cz: Došlo k chybě serveru.
es_es: Se produjo un error del servidor.
et_ee: Tekkis serveripoolne viga.
fi_fi: Palvelinvirhe tapahtui.

source: Invalid input.
cs_cz: Neplatný vstup.
es_es: Entrada no válida.
et_ee: Vigane sisend.
fi_fi: Virheellinen syöte.

source: Malformed request.
cs_cz: Chybný požadavek.
es_es: Solicitud malformada.
et_ee: Vigase vorminguga päring.
fi_fi: Virheellinen pyyntö.

source: Unsupported media type.
cs_cz: Nepodporovaný typ média.
es_es: Tipo de medio no admitido.
et_ee: Mitterahuldatud meediatüüp.
fi_fi: Mediatyyppiä ei tueta.

source: Not acceptable.
cs_cz: Nepřijatelné.
es_es: No aceptable.
et_ee: Ei ole vastuvõetav.
fi_fi: Ei hyväksyttävä.

source: Request was throttled.
cs_cz: Požadavek byl omezen.
es_es: Se ha limitado la solicitud.
et_ee: Päringute arvu on piiratud.
fi_fi: Pyyntöä rajoitettiin.

source: Method "%(method)s" not allowed.
cs_cz: Metoda "%(method)s" není povolena.
es_es: Método "%(method)s" no permitido.
et_ee: Meetod "%(method)s" pole lubatud.
fi_fi: Menetelmä "%(method)s" ei ole sallittu.

source: ids must be a list of integers
cs_cz: ids musí být seznam celých čísel
es_es: ids debe ser una lista de enteros
et_ee: ids peab olema täisarvude loend
fi_fi: ids täytyy olla kokonaislukujen lista

source: Cannot delete current user.
cs_cz: Aktuálního uživatele nelze smazat.
es_es: No se puede eliminar al usuario actual.
et_ee: Praegust kasutajat ei saa kustutada.
fi_fi: Nykyistä käyttäjää ei voi poistaa.

source: Passwords do not match.
cs_cz: Hesla se neshodují.
es_es: Las contraseñas no coinciden.
et_ee: Paroolid ei ühti.
fi_fi: Salasanat eivät täsmää.

source: Invalid token.
cs_cz: Neplatný token.
es_es: Token no válido.
et_ee: Vigane tunnus.
fi_fi: Virheellinen tunniste.

source: Token is invalid or expired
cs_cz: Token je neplatný nebo vypršel
es_es: El token no es válido o ha expirado
et_ee: Tunnus on vigane või aegunud.
fi_fi: Tunniste on virheellinen tai vanhentunut

source: Given token not valid for any token type
cs_cz: Zadaný token není platný pro žádný typ tokenu
es_es: El token proporcionado no es válido para ningún tipo de token
et_ee: Antud tunnus ei sobi ühegi tüübi jaoks.
fi_fi: Annettu tunniste ei ole kelvollinen millekään tunnistetyypille

source: User is inactive
cs_cz: Uživatel je neaktivní
es_es: El usuario está inactivo
et_ee: Kasutaja on mitteaktiivne.
fi_fi: Käyttäjä on passiivinen

source: No active account found with the given credentials
cs_cz: Pro zadané údaje nebyl nalezen žádný aktivní účet
es_es: No se encontró ninguna cuenta activa con las credenciales proporcionadas
et_ee: Antud andmetega aktiivset kontot ei leitud.
fi_fi: Annetuilla tunnuksilla ei löytynyt aktiivista tiliä

source: No refresh token provided
cs_cz: Nebyl poskytnut obnovovací token
es_es: No se proporcionó el token de actualización
et_ee: Värskendustokenit ei ole esitatud
fi_fi: Virkistystunnistetta ei annettu

source: Session expired due to server restart.
cs_cz: Relace vypršela kvůli restartu serveru.
es_es: La sesión expiró debido al reinicio del servidor.
et_ee: Seanss aegus serveri taaskäivitamise tõttu.
fi_fi: Istunto vanhentui palvelimen uudelleenkäynnistyksen vuoksi.

source: Invalid refresh token.
cs_cz: Neplatný obnovovací token.
es_es: Token de actualización no válido.
et_ee: Kehtetu värskendustoken.
fi_fi: Virheellinen virkistystunniste.

source: Failed to blacklist token.
cs_cz: Token se nepodařilo přidat na černou listinu.
es_es: No se pudo incluir el token en la lista negra.
et_ee: Tokeni musta nimekirja lisamine ebaõnnestus.
fi_fi: Tunnistetta ei voitu lisätä estolistalle.

source: Database error while applying changes.
cs_cz: Chyba databáze při provádění změn.
es_es: Error de base de datos al aplicar los cambios.
et_ee: Andmebaasi viga muudatuste rakendamisel.
fi_fi: Tietokantavirhe muutoksia tehtäessä.

source: Password updated.
cs_cz: Heslo aktualizováno.
es_es: Contraseña actualizada.
et_ee: Parool uuendatud.
fi_fi: Salasana päivitetty.

source: No file provided
cs_cz: Nebyl poskytnut žádný soubor
es_es: No se proporcionó ningún archivo
et_ee: Faili ei esitatud
fi_fi: Tiedostoa ei annettu

source: Must include 'login' (or 'email'/'username') and 'password'.
cs_cz: Musí obsahovat 'login' (nebo 'email'/'username') a 'password'.
es_es: Debe incluir 'login' (o 'email'/'username') y 'password'.
et_ee: Tuleb esitada 'login' (või 'email'/'username') ja 'password'.
fi_fi: Täytyy sisältää 'login' (tai 'email'/'username') ja 'password'.

source: Email required
cs_cz: E-mail je povinný
es_es: Correo electrónico requerido
et_ee: E-posti aadress on nõutav
fi_fi: Sähköpostiosoite vaaditaan

source: user_id claim missing
cs_cz: Chybí claim user_id
es_es: Falta el atributo 'user_id'
et_ee: user_id nõue puudub
fi_fi: user_id-claim puuttuu

source: Session expired due to inactivity.
cs_cz: Relace vypršela z důvodu nečinnosti.
es_es: La sesión expiró por inactividad.
et_ee: Seanss aegus tegevusetuse tõttu.
fi_fi: Istunto vanhentui toimettomuuden vuoksi.

source: This password is too short. It must contain at least 8 characters.
es_es: Esta contraseña es demasiado corta. Debe contener al menos 8 caracteres.
et_ee: See parool on liiga lühike. See peab sisaldama vähemalt 8 märki.
fi_fi: Tämä salasana on liian lyhyt. Sen tulee sisältää vähintään 8 merkkiä.

source: The password is too similar to the %(verbose_name)s.
es_es: La contraseña es demasiado similar al nombre de %(verbose_name)s.
et_ee: Parool on kasutajanimega liiga %(verbose_name)s.
fi_fi: Salasana on liian samanlainen kuin %(verbose_name)s.

source: This password is too common.
es_es: Esta contraseña es demasiado común.
et_ee: See parool on liiga levinud.
fi_fi: Tämä salasana on liian yleinen.

source: Enter a valid email address.
es_es: Introduzca una dirección de correo electrónico válida.
et_ee: Sisestage kehtiv e-posti aadress.
fi_fi: Anna kelvollinen sähköpostiosoite.

source: No User matches the given query.
es_es: No hay ningún usuario que coincida con la consulta dada.
et_ee: Ükski kasutaja ei vasta antud päringule.
fi_fi: Yhtään käyttäjää ei löytynyt annetulla haulla.

source: This field may not be blank.
es_es: Este campo no puede estar vacío.
