Repository: inartov555/user_hub_web_app
Catalog: users_app/backend/locale/*/LC_MESSAGES/django.po
Languages: uk_ua

source: Unknown error.
uk_ua: Невідома помилка.

source: Not authenticated.
uk_ua: Не автентифіковано.

source: Authentication credentials were not provided.
uk_ua: Облікові дані автентифікації не надано.

source: You do not have permission to perform this action.
uk_ua: У вас немає дозволу виконувати цю дію.

source: Not found.
uk_ua: Не знайдено.

source: A server error occurred.
uk_ua: Сталася помилка сервера.

source: Invalid input.
uk_ua: Недійсні вхідні дані.

source: Malformed request.
uk_ua: Некоректний запит.

source: Unsupported media type.
uk_ua: Непідтримуваний тип медіа.

source: Not acceptable.
uk_ua: Неприйнятно.

source: Request was throttled.
uk_ua: Перевищено ліміт запитів.

source: Method "%(method)s" not allowed.
uk_ua: Метод "%(method)s" не дозволено.

source: ids must be a list of integers
uk_ua: "ids" має бути списком цілих чисел

source: Cannot delete current user.
uk_ua: Неможливо видалити поточного користувача.

source: Passwords do not match.
uk_ua: Паролі не збігаються.

source: Invalid token.
uk_ua: Недійсний токен.

source: Token is invalid or expired
uk_ua: Токен недійсний або прострочений

source: Given token not valid for any token type
uk_ua: Наданий токен не дійсний для жодного типу токенів

source: User is inactive
uk_ua: Користувач неактивний

source: No active account found with the given credentials
uk_ua: Активного облікового запису з наданими обліковими даними не знайдено

source: No refresh token provided
uk_ua: Токен оновлення не надано

source: Session expired due to server restart.
uk_ua: Сеанс завершено через перезапуск сервера.

source: Invalid refresh token.
uk_ua: Недійсний токен оновлення.

source: Failed to blacklist token.
uk_ua: Не вдалося додати токен до чорного списку.

source: Database error while applying changes.
uk_ua: Помилка бази даних під час застосування змін.

source: Password updated.
uk_ua: Пароль оновлено.

source: No file provided
uk_ua: Файл не надано

source: Must include 'login' (or 'email'/'username') and 'password'.
uk_ua: Потрібно вказати 'login' (або 'email'/'username') та 'password'.

source: Email required
uk_ua: Потрібна адреса електронної пошти

source: user_id claim missing
uk_ua: Відсутній атрибут 'user_id'

source: Session expired due to inactivity.
uk_ua: Сеанс завершено через неактивність.

source: This password is too short. It must contain at least 8 characters.
uk_ua: Цей пароль надто короткий. Він має містити щонайменше 8 символів.

source: The password is too similar to the %(verbose_name)s.
uk_ua: Пароль надто схожий на ім’я %(verbose_name)s.

source: This password is too common.
uk_ua: Цей пароль є надто поширеним.

source: Enter a valid email address.
uk_ua: Введіть дійсну адресу електронної пошти.

source: No User matches the given query.
uk_ua: Жоден користувач не відповідає вказаному запиту.

source: This field may not be blank.
uk_ua: Це поле не може бути порожнім.

source: A user with this email already exists.
uk_ua: Користувач із цією електронною адресою вже існує.

source: Not permitted.
uk_ua: Не дозволено.

source: non_field_errors
uk_ua: Помилки, не пов'язані з полями

source: username
uk_ua: Ім'я користувача

source: password
uk_ua: Пароль

source: email
uk_ua: Електронна пошта

source: bio
uk_ua: Біографія

source: locale
uk_ua: Регіональні налаштування

source: first_name
uk_ua: Ім'я

source: last_name
uk_ua: Прізвище

source: Ensure this field has no more than 40 characters.
uk_ua: Переконайтеся, що це поле містить не більше 40 символів.

source: Ensure this field has at least 5 characters.
uk_ua: Переконайтеся, що це поле містить принаймні 5 символів.

source: A user with this username already exists.
uk_ua: Користувач із таким іменем користувача вже існує.
